In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('product_sales.csv')
data

            SaleRep Region  Orders  TotalSales
0      Felice Lunck   West     218       44489
1    Doralynn Pesak   West     233       61035
2  Madelle Martland   East     264       62603
3      Yasmin Myhan  South     110       59377
4   Marmaduke Webbe   East     188       78771
5   Christiano Vero   East     265       68506
6   Cecelia Jealous   West      93       53634
7    Isaak Housiaux   East     189       62455
8    Derril Howland   East     385       73460
9       Judon Allom   West     230       51067

In [3]:
data.to_html('product_sales.html', index=False)

### Export the first and the last column to a csv file

In [6]:
first_column = data.head(1)
last_column = data.tail(1)

first_last_columns = pd.concat([first_column, last_column], ignore_index=True)

first_last_columns.to_csv('first_last_columns.csv', index=False)

print("First and Last Columns:")
first_last_columns

First and Last Columns:

        SaleRep Region  Orders  TotalSales
0  Felice Lunck   West     218       44489
1   Judon Allom   West     230       51067

### Export data related to the west region to an HTML file

In [7]:
west_region_data = data[data['Region'] == 'West']
west_region_data.to_html('west_region_sales.html', index=False)